In [4]:
from sqlalchemy import create_engine

In [2]:
pip install SQLAlchemy

Requirement already satisfied: SQLAlchemy in c:\programdata\anaconda3\lib\site-packages (1.3.13)
Note: you may need to restart the kernel to use updated packages.

In [8]:
engine=create_engine('sqlite:///sqlite_db_pythonsqlite.db')

In [11]:
table_names= engine.table_names()

In [12]:
table_names

['Bookings', 'Facilities', 'Members']

In [22]:
df=pd.read_sql_query('SELECT facs.name, SUM(CASE WHEN memid =0 THEN slots * facs.guestcost ELSE slots * membercost END ) AS revenue FROM Bookings bks INNER JOIN Facilities facs ON bks.facid = facs.facid GROUP BY facs.name HAVING revenue <1000 ORDER BY revenue',engine)

In [20]:
import pandas as pd

In [23]:
df.head()

            name  revenue
0   Table Tennis      180
1  Snooker Table      240
2     Pool Table      270

In [24]:
df_query2=pd.read_sql_query('SELECT surname, firstname FROM Members ORDER BY surname, firstname',engine)

In [25]:
df_query2

              surname  firstname
0               Bader   Florence
1               Baker       Anne
2               Baker    Timothy
3              Boothe        Tim
4             Butters     Gerald
5              Coplin       Joan
6             Crumpet      Erica
7                Dare      Nancy
8             Farrell      David
9             Farrell     Jemima
10              GUEST      GUEST
11            Genting    Matthew
12               Hunt       John
13              Jones      David
14              Jones    Douglas
15           Joplette     Janice
16          Mackenzie       Anna
17               Owen    Charles
18             Pinker      David
19            Purview  Millicent
20             Rownam        Tim
21             Rumney  Henrietta
22             Sarwin  Ramnaresh
23              Smith     Darren
24              Smith     Darren
25              Smith       Jack
26              Smith      Tracy
27           Stibbons     Ponder
28              Tracy     Burton
29         Tupperware   Hyacinth
30  Worthington-Smyth      Henry